import Image from 'next/image';
import Link from 'next/link';
import { useState } from 'react';
import OfferGrid from './OfferGrid';

function Offer() {
  
  return (
    <div className='bg-white text-black'>
        <h1 className='text-center font-semibold text-4xl py-10'>Послуги</h1>
        <OfferGrid>

        <div className='flex flex-col gap-y-5'>
            <h1 className='font-semibold'>ЕКСПРЕС-АНАЛІЗ БРЕНДУ</h1>
            <p>Проведення швидкого дослідження вашого бренду, аналіз його позиціонування, конкурентне середовище та сприйняття цільової аудиторії, аби надати вам цінну інформацію та рекомендації для подальшого розвитку та успішної стратегії бренду.</p>
        </div>

        <div>
            <h1 className='font-semibold'>РОЗРОБКА ДИЗАЙНУ (НЕЙМІНГ, АЙДЕНТИКА, БРЕНДБУК)</h1>
            <p>Створення унікальних та привабливих елементів бренду, зокрема його назву, логотип, кольорову палітру та стиль, щоб ви могли вирізнятися на ринку та створити послідовний та професійний образ вашої компанії</p>
        </div>

        <div>
            <h1 className='font-semibold'>СТВОРЕННЯ ТА ОФОРМЛЕННЯ МЕДІА-ПРОСТОРУ ДЛЯ КОМПАНІЇ</h1>
            <p>Розробка і налаштовуння медіа-каналів, в тому числі соціальні мережі, веб-сайти та інші платформи, завдяки яким Ваша компанія ефективно комунікувала зі своєю аудиторією, забезпечувала зростання впізнаваності та залучення нових клієнті</p>
        </div>

        <div>
            <h1 className='font-semibold'>СТВОРЕННЯ ПРОФЕСІЙНОГО МЕДІАКОНТЕНТУ З ТЕКСТАМИ ТА БАЗОЮ ІНТЕРВʼЮ З ПРОВІДНИМИ ФАХІВЦЯМИ ТА КЕРІВНИЦТВА</h1>
            <p>Наша команда розробляє високоякісний відео- та фотоконтент, супроводжує його інформативними текстами та проводить інтервю з експертами вашої компанії, допомагаючи вам ефективно комунікувати зі своєю аудиторією та підвищувати рівень впізнаваності та довіри</p>
        </div>

        <div>
            <h1 className='font-semibold'>ТАРГЕТОВАНА РЕКЛАМА FACEBOOK\INSTAGRAM</h1>
            <p>Створення та оптимізація рекламних кампанії на платформах Facebook та Instagram, забезпечуючи точне налаштування та спрямування реклами на вашу цільову аудиторію, що дозволяє досягти кращих результатів та збільшити конверсію</p>
        </div>

        <div>
            <h1 className='font-semibold'>SEO ПРОСУВАННЯ САЙТІВ</h1>
            <p>Забезпечення оптимізацією вашого веб-сайту, включаючи ключові слова, внутрішню структуру, мета-теги та посилання, для поліпшення видимості сайту в пошукових системах. Це допомагає залучити більше органічного трафіку, підвищити рейтинг вашого сайту та покращити його позиції у пошукових результатів</p>
        </div>

        <div>
            <h1 className='font-semibold'>КОНТЕКСТНА РЕКЛАМА</h1>
            <p>Створення та налаштування рекламних кампанії, що показуються відповідно до контексту та інтересів користувачів. Це дозволяє ефективно дотягнутися до цільової аудиторії, показуючи рекламні оголошення на веб-сайтах, де вони можуть бути найбільш релевантними та привертливими для потенційних клієнтів.</p>
        </div>

        <button className='px-3 py-4 bg-[#1F5BFF] rounded-full text-white w-52 self-center mb-4 text-base font-semibold'>Подати заявку</button>
        </OfferGrid>
    </div>
  );
}

export default Offer;

