import Image from 'next/image';
import Link from 'next/link';
import { useState } from 'react';

function Solutions() {
  
  return (
    <div className='bg-white text-black'>



    <h1 className='text-center font-semibold text-4xl py-10 pb-32'>Наші Послуги</h1>

    <div className="w-4/5 mx-auto min-h-screen flex flex-col gap-y-4 md:w-9/12 pb-32">
    
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">1</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>
    </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">2</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>    </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">3</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>    </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">4</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>    </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">5</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>    </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">6</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>  </div>
  
    <div className="flex w-2/3 lg:odd:ml-auto">
        <h2 className="text-[11.5rem] font-bold text-[#3C45EE] mt-[-100px]">7</h2>
        <div className='flex flex-col'>
                  <h2 className='font-semibold mb-[-25px]'>Розробка найменування компанії та слогану</h2>
                  <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
        </div>
    </div>
  
  </div>


    </div>

  );
}

export default Solutions;

