import Image from 'next/image';
import Link from 'next/link';
import { useState } from 'react';

function Solutions() {
  
  return (
    <div className='bg-white text-black'>



    <h1 className='text-center font-semibold text-4xl py-10'>Наші Послуги</h1>

        <div className="max-w-lg mx-auto min-h-screen flex flex-col gap-y-4">
    
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">1</h2>
        <p className="mt-8">Ми пропонує творчий та стратегічний підхід до створення ідеального імя для вашого бізнесу, а також запам ятовуваного слогану, що відображає його цілі та цінності. Наші експерти враховують вашу унікальність, цільову аудиторію та конкурентне середовище, щоб створити найменування та слоган, що привернуть увагу та сприятимуть будівництву сильного бренду.</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">2</h2>
        <p className="mt-8">Наша команда професіоналів з дизайну та маркетингу пропонує повний спектр послуг зі створення логотипу та брендового стилю. Ми розробляємо унікальні логотипи, які виразно відображають вашу ідентичність та підкреслюють переваги вашого бізнесу. Крім того, ми створюємо брендовий стиль, який включає кольорову гаму, типографіку та стиль оформлення, забезпечуючи гармонію і цілісність в сприйнятті вашої компанії</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">3</h2>
        <p className="mt-8">Допомага підприємцям і компаніям створити ефективну онлайн-присутність. Ми забезпечуємо розробку зручного та професійного веб-сайту візитки, який висвітлює ваші продукти, послуги та контактну інформацію. Крім того, ми допомагаємо вам створити і налаштувати соціальні сторінки на популярних платформах, таких як Facebook, Instagram, Twitter тощо, що дозволить вам залучати і взаємодіяти з вашою цільовою аудиторією. Наша команда фахівців з веб-дизайну та соціальних медіа забезпечує високу якість роботи та персоналізований підхід до кожного проекту, щоб забезпечити ваш успіх в онлайн-середовищі.</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">4</h2>
        <p className="mt-8">Ми пропонуемо допомагу вашому бізнесу залучати увагу, збільшувати свою присутність і розширювати свою аудиторію. Ми розробляємо та виконуємо стратегічні рекламні кампанії, які охоплюють різні канали. Наші експерти з маркетингу аналізують вашу цільову аудиторію, конкурентну обстановку та ваші цілі, щоб створити ефективну стратегію просування бренду, яка підкреслить ваші унікальність і приверне увагу. Ми також надаємо аналітику та звіти про результативність кампаній, щоб ви могли виміряти їх ефективність та вносити належні корективи для досягнення ваших маркетингових цілей. Наша мета - допомогти вам розкрити повний потенціал вашого бренду та досягти успіху на ринку.</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">5</h2>
        <p className="mt-8">Наша послуга надає вам можливість створити захоплюючий вміст, який привертає увагу вашої аудиторії. Ми надаємо повний пакет послуг, включаючи створення візуального контенту, як фотографії та відео, а також професійно написаних текстів для них. Наша команда експертів допоможе вам розробити креативний та релевантний вміст, який виразно передає ваші повідомлення та цінності.</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">6</h2>
        <p className="mt-8">Наша послуга допоможе вам забезпечити ефективну присутність в Інтернеті та залучати нових клієнтів до вашої клініки. Ми займаємося адмініструванням вашого веб-сайту, забезпечуємо його актуалізацію, додавання нового контенту та вирішення технічних питань.
  Наша команда професіоналів з маркетингу та веб-адміністрування забезпечить ефективне управління вашими онлайн-каналами, що дозволить вам зосередитися на наданні якісних медичних послуг і розширенні вашої клієнтської бази.</p>
    </div>
  
    <div className="flex w-2/3 md:odd:ml-auto">
        <h2 className="text-9xl text-[#3C45EE]">7</h2>
        <p className="mt-8">Ця послуга дозволяє максимально ефективно використовувати ваш рекламний бюджет. Ми проводимо аналіз вашої цільової аудиторії та розробляємо стратегію таргетованої реклами, спрямованої на точно визначену групу потенційних клієнтів.
  Завдяки налаштуванню рекламних кампаній на різних платформах, таких як Google Ads, Facebook, Instagram тощо, ми забезпечуємо точне спрямування вашої реклами на цільову аудиторію, що підвищує ймовірність отримання релевантних та якісних переходів на ваш веб-сайт або сторінку.
  </p>
    </div>
  
  </div>


    </div>

  );
}

export default Solutions;

